//
//  LGSpecialTrainingVersion.h
//  LGSpecialTrainingFramework
//
//  Created by lancoo on 2020/3/23.
//  Copyright © 2020 SG. All rights reserved.
//

#ifndef LGSpecialTrainingVersion_h
#define LGSpecialTrainingVersion_h

/** 版本：0.3.4    2019-11-16 */
/** 1、问题优化；  */

/** 版本：0.3.3    2019-11-10 */
/** 1、问题优化；  */

/** 版本：0.3.2    2019-11-02 */
/** 1、问题优化；  */

/** 版本：0.3.1    2019-10-30 */
/** 1、问题优化；  */

/** 版本：0.3.0    2019-10-29 */
/** 1、标准化问题优化；  */

/** 版本：0.2.9    2019-10-13 */
/** 1、实用化问题优化；2、篇章资料新增句子拆分逻辑处理；3、新增训练结果界面积分动效  */

/** 版本：0.2.8    2019-09-25 */
/** 1、问题优化  */

/** 版本：0.2.7    2019-09-23 */
/** 1、听力训练词汇听写新增知识点是否已存在单词本的判断接口 ；
    2、新增过关训练首页等级UI  */

/** 版本：0.2.6    2019-09-16 */
/** 1、问题优化  */

/** 版本：0.2.5    2019-09-10 */
/** 1、提示弹框优化  */

/** 版本：0.2.4    2019-09-07 */
/** 1、实用化问题修改  */

/** 版本：0.2.3    2019-09-01 */
/** 1、实用化问题修改  */

/** 版本：0.2.2    2019-08-28 */
/** 1、问题优化  */

/** 版本：0.2.1    2019-08-24 */
/** 1、听写作答结果界面UI优化  */

/** 版本：0.2.0    2019-08-18 */
/** 1、作答结果接口调整  */

/** 版本：0.1.9    2019-08-17 */
/** 1、实用化问题优化  */

/** 版本：0.1.8    2019-08-14 */
/** 1、词汇听写流程调整  */

/** 版本：0.1.7    2019-08-13 */
/** 1、实用化问题优化  */

/** 版本：0.1.6    2019-08-12 */
/** 1、设置自动填充答案字段  */

/** 版本：0.1.5    2019-07-30 */
/** 1、优化资料列表换一批提示文字
    2、优化只有语音作答题型才会有网络异常时提示 */

/** 版本：0.1.4    2019-07-29 */
/** 1、优化作答提交字段缺失导致大数据评阅问题  */

/** 版本：0.1.3    2019-07-16 */
/** 1、专业化过关训练资源整合瘦身  */

/** 版本：0.1.2    2019-07-13 */
/** 1、专业化过关训练稳定版发布  */

/** 版本：0.1.1    2019-06-24 */
/** 1、专业化过关训练测试版发布  */

#endif /* LGSpecialTrainingVersion_h */
